import React from 'react'
import { StyleSheet } from 'quantum'
import Close from './Close'

const styles = StyleSheet.create({
  self: {
    height: '80%',
    width: '80%',
    maxWidth: '700px',
    maxHeight: '600px',
    background: '#ffffff',
    overflowY: 'auto',
    padding: '40px',
    fontFamily: 'Turum2',
    fontSize: '24px',
    boxSizing: 'border-box',
    position: 'relative',
    '& div': {
      fontWeight: 'bold',
      fontSize: '36px',
    },
    '& ul': {
      paddingLeft: '0px',
      '& li': {
        marginLeft: '20px',
      },
    },
  },
})

const stopWheel = (event) => {
  event.stopPropagation()
}

const Content = ({ onClose }) => (
  <div className={styles()} onWheel={stopWheel}>
    <Close onClick={onClose} />
    <div>
      Открытое пользовательское соглашение сайта проекта «Народная Сборная»
    </div>
    <p>
      1. Основная информация
    </p>
    <p>
      1.1 Организатором проекта «Народная Сборная» является Открытое Акционерное Общество «Рекламное агентство «КОФЕ» (ИНН 7722716974, КПП 770101001, ОГРН 1107746379421). Целью проекта «Народная Сборная» является выявление талантливых спортсменов-любителей с целью формирования команды под рабочим названием «Народная Сборная».
    </p>
    <p>
      1.2. Участие в проекте могут принять физические лица, граждане Российской Федерации, достигшие возраста 18 лет.
    </p>
    <p>
      1.3. Для участия в проекте необходимо стать Пользователем Сайта «Народная Сборная», расположенного по адресу www.народнаясборная.рф, заполнив все поля регистрационной формы.
    </p>
    <p>
      1.4. Сайт «Народная Сборная» (далее - «Сайт») является Интернет-ресурсом, расположенным по адресу www.народнаясборная.рф. Предназначение Сайта – обеспечение возможности сбора заявок на участие в проекте «Народная Сборная» и возможность их оценки. Пользователями Сайта (далее - «Пользователи») являются физические лица, заинтересованные в участии в проекте «Народная Сборная», экспертная комиссия, заинтересованная в оценке и отборе физических лиц, направивших заявки через Сайт с целью утверждения состава участников проекта «Народная Сборная», а также любые третьи лица, уполномоченные Администрацией Сайта и/или Организатором проекта и привлеченные в целях его реализации.
    </p>
    <p>
      1.5. Под Администрацией Сайта в настоящем Пользовательском соглашении (далее - «Соглашение») понимается владелец домена www.народнаясборная.рф и команда проекта «Народная Сборная». Обращения, предложения и претензии физических и юридических лиц к Администрации Сайта в связи с настоящим Соглашением и всеми вопросами по функционированию Сайта, нарушениями прав и интересов третьих лиц при его использовании, могут быть направлены по электронной почте на адрес PR@narodnayasbornaya.ru.
    </p>
    <p>
      1.6. Администрация Сайта не занимается трудоустройством. Она занимается поиском информации, предоставляет Пользователям возможность размещать информацию на Сайте и пользоваться Услугами Сайта. Администрация Сайта не несет ответственности за действия Пользователей и предупреждает о возможной ответственности в случае использования Пользователями при регистрации или иных действиях на Сайте объектов авторского права третьих лиц. Пользователи несут персональную ответственность за предоставленные ими на Сайте материалы (включая, но не ограничиваясь фото, видео, аудио и персональные данные).
    </p>
    <p>
      1.7. Условия проекта «Народная Сборная» как целиком, так и частично могут быть изменены Организатором в одностороннем порядке без дополнительного уведомления Пользователей. В том числе, Организатор оставляет за собой право в одностороннем порядке принять решение о завершении проекта без дополнительного уведомления Пользователей.
    </p>
    <p>
      2. Общие положения
    </p>
    <p>
      2.1. Настоящее Соглашение разработано Администрацией Сайта и определяют условия использования Сайта, а также права и обязанности его Пользователей и Администрации. Соглашение распространяется также на отношения, связанные с правами и интересами третьих лиц, которые могут быть затронуты в результате действий Пользователей Сайта. Пользование Сайтом возможно только на условиях, изложенных в данном Соглашении.
    </p>
    <p>
      2.2. Настоящее Соглашение является юридически обязательным соглашением между Пользователем и Администрацией Сайта, предметом которого является предоставление Администрацией Сайта Пользователю Услуг по использованию Сайта. Пользователь обязан полностью ознакомиться с настоящим Соглашением до момента регистрации на Сайте. Регистрация Пользователя на Сайте означает полное и безоговорочное принятие Пользователем настоящего Соглашения.
    </p>
    <p>
      2.3. Настоящее Соглашение может быть изменено и/или дополнено Администрацией Сайта в одностороннем порядке без какого-либо специального уведомления. Настоящее Соглашение является общедоступным документом. Продолжение использования Сайта Пользователем после внесения изменений и/или дополнений в настоящее Соглашение означает согласие Пользователя с такими изменениями и/или дополнениями.
    </p>
    <p>
      2.4. Регистрация Пользователя на Сайте является бесплатной и производится по предоставленному адресу действующей электронной почты. Пользователем Сайта является физическое лицо, зарегистрированное на Сайте в соответствии с установленным настоящим Соглашением порядком.
    </p>
    <p>
      2.5. При регистрации на Сайте Пользователь обязан предоставить Администрации Сайта необходимую достоверную и актуальную информацию. Пользователь несет ответственность за достоверность, актуальность и полноту предоставленной при регистрации информации, и отсутствие претензий третьих лиц к ней.
    </p>
    <p>
      2.6. Если Пользователь предоставляет неверную регистрационную информацию или у Администрации Сайта есть основания полагать, что предоставленная лицом регистрационная Информация недостоверна, неполна, ненадлежащего качества, неточна, нарушает условия настоящего Соглашения, или, что лицо использует чужие данные, то Администрация Сайта имеет право приостановить либо отменить регистрацию и отказать в полном доступе ко всем или некоторым возможностям Сайта, и/или удалить профиль.
    </p>
    <p>
      2.7. Пользователь обязуется не разглашать, не передавать третьим лицам свои логин и пароль, а также предпринять все необходимые усилия для того, чтобы его логин и пароль не были доступны третьим лицам. Пользователь самостоятельно несет ответственность за сохранность своего пароля, а также за все последствия, которые могут возникнуть в результате его несанкционированного и/или иного использования. Администрация Сайта не несет ответственность за возможную потерю или порчу данных, которая может произойти из-за нарушения Пользователем положений данной части настоящего Соглашения.
    </p>
    <p>
      3. Персональные данные и обязанности пользователя
    </p>
    <p>
      3.1. Размещая на Сайте свои персональные данные, Пользователь подтверждает, что делает это добровольно. Пользователь несет личную ответственность за любую информацию, которую размещает на Сайте, сообщает другим Пользователям, а также за любые взаимодействия с другими Пользователями.
    </p>
    <p>
      3.2. Персональные данные Пользователя, размещенные на Сайте являются общедоступными, и любой Пользователь Сайта либо незарегистрированный посетитель Сайта может ознакомиться с ними. При этом Администрация Сайта не несет ответственности за использование персональных данных Пользователей другими лицами.
    </p>
    <p>
      3.3. Размещая на Сайте свои аудио- фото- и видео-материалы, Пользователь передает Администрации Сайта и иным лицам, привлеченным Администрацией в целях реализации проекта «Народная Сборная» право на хранение, обработку, изменение и использование таких материалов с целью реализации проекта «Народная Сборная» (в том числе, право на использование таких материалов в рекламных целях проекта «Народная Сборная»)
    </p>
    <p>
      3.4. Пользователю при использовании Сайта запрещается:
    </p>
    <p>
      <ul>
        <li>
          Регистрироваться в качестве Пользователя от имени или вместо другого лица (создавать «фальшивый профиль»), вводить Пользователей в заблуждение относительно своей личности, используя логин и пароль другого зарегистрированного Пользователя.
        </li>
        <li>
          Искажать сведения о себе (в том числе возраст, рост, вес, опыт работы и другие персональные данные)
        </li>
        <li>
          Незаконно загружать, хранить, публиковать, распространять и предоставлять доступ или иным образом использовать интеллектуальную собственность Пользователей и третьих лиц.
        </li>
        <li>
          Использовать программное обеспечение и осуществлять действия, направленные на нарушение нормального функционирования Сайта и его Услуг или персональных профилей Пользователей, осуществлять массовые рассылки сообщений без согласия Пользователей и Администрации Сайта. Загружать, хранить, публиковать, распространять и предоставлять доступ или иным образом использовать вирусы и другие вредоносные программы.
        </li>
        <li>
          Использовать автоматизированные скрипты (программы) для сбора информации на Сайте и/или взаимодействия с Сайтом и его Услугами.
        </li>
        <li>
          Любым способом, в том числе, но, не ограничиваясь, путем обмана, злоупотребления доверием, взлома, пытаться получить доступ к логину и паролю другого Пользователя.
        </li>
        <li>
          Осуществлять незаконные сбор и обработку персональных данных других Пользователей.
        </li>
        <li>
          Осуществлять или пытаться получить доступ к каким-либо Услугам иным способом, кроме как через интерфейс, предоставленный Администрацией Сайта.
        </li>
        <li>
          Воспроизводить, дублировать, копировать, продавать, осуществлять торговые операции и перепродавать Услуги Сайта.
        </li>
        <li>
          Размещать коммерческую и политическую рекламу
        </li>
        <li>
          Размещать любую другую информацию, которая, по личному мнению
        </li>
      </ul>
    </p>
    <p>
      3.5. Пользователь обязуется не загружать, хранить, публиковать, распространять и предоставлять доступ или иным образом использовать любую информацию, которая:
    </p>
    <p>
      <ul>
        <li>
          является заведомо ложной, искаженной или измененной;
        </li>
        <li>
          содержит угрозы, дискредитирует, оскорбляет, порочит честь и достоинство или деловую репутацию, или нарушает неприкосновенность частной жизни других Пользователей или третьих лиц, нарушает права несовершеннолетних лиц;
        </li>
        <li>
          является вульгарной или непристойной, содержит нецензурную лексику, порнографические изображения, тексты или видеоматериалы;
        </li>
        <li>
          содержит сцены насилия над людьми или животными;
        </li>
        <li>
          содержит описание средств и способов суицида, любое подстрекательство к его совершению;
        </li>
        <li>
          пропагандирует и/или способствует разжиганию расовой, религиозной, этнической ненависти или вражды, фашизма или идеологию расового превосходства, содержит экстремистские материалы;
        </li>
        <li>
          пропагандирует преступную деятельность или содержит советы, инструкции или руководства по совершению преступных действий, пропагандирует занятие проституцией;
        </li>
        <li>
          содержит материалы ограниченного доступа, включая, но не ограничиваясь, государственную и коммерческую тайну, а также факты частной жизни третьих лиц;
        </li>
        <li>
          содержит рекламу или описывает привлекательность употребления наркотических веществ, их распространение, рецепты изготовления и советы по употреблению;
        </li>
        <li>
          носит мошеннический характер, а также нарушает иные права и интересы физических и юридических лиц.
        </li>
      </ul>
    </p>
    <p>
      3.6. Администрация Сайта имеет право без согласия Пользователя передавать любые его данные Организатору проекта, а также государственным органам, в том числе органам дознания и следствия по их мотивированному запросу или на основании судебного акта, третьим лицам по их мотивированному письменному запросу в случае нарушения или предполагаемого нарушения их прав, а также в иных случаях, предусмотренных действующим законодательством.
    </p>
    <p>
      4. Использование Сайта
    </p>
    <p>
      4.1 Использование Сайта Пользователем допускается только в соответствии с настоящим Соглашением. Администрация Сайта является законным правообладателем и ей принадлежат все исключительные имущественные и иные соответствующие права на Сайт, в том числе, но, не ограничиваясь перечисленным, на программное обеспечение, графику, дизайн, фотографии, картинки, видео, статьи и базу данных Сайта.
    </p>
    <p>
      4.2. Любая Информация, размещаемая на Сайте Пользователем, соответственно, принадлежит такому Пользователю. Размещая Информацию на Сайте, Пользователь подтверждает, что он обладает всеми необходимыми для этого правами и полномочиями, также Пользователь соглашается с тем, что такая Информация становится доступной для всех Пользователей Сайта, Администрации Сайта и третьих лиц, привлеченных Администрацией Сайта с целью реализации проекта «Народная Сборная».
    </p>
    <p>
      4.3. Размещая Информацию на Сайте (видео, фото, анкетные данные), Пользователь автоматически безвозмездно, безусловно и безотзывно предоставляет Администрации Сайта неисключительное право на использование такой Информации, в том числе, но не ограничиваясь, на воспроизведение, копирование, подбор, систематизацию, преобразование, изменение, редактирование, перевод, публикацию, распространение (частично или полностью) любыми законными способами.
    </p>
    <p>
      4.4. Пользователь не имеет права каким-либо образом изменять, копировать, стирать, сохранять, загружать, распространять, передавать, продавать, публиковать и иным образом использовать Информацию, размещенную на Сайте (за исключением той Информации, которая была законно размещена на Сайте самим Пользователем) без предварительного разрешения Администрации Сайта и/или соответствующего правообладателя, кроме случаев, когда Администрация Сайта и/или правообладатель явным образом выразили свое согласие на свободное использование Информации любым лицом.
    </p>
    <p>
      4.5. Администрация Сайта сохраняет за собой право изменять оформление Сайта, его содержание, список Услуг, изменять или дополнять используемые скрипты, программное обеспечение и другие объекты, используемые или хранящиеся на Сайте, любые серверные приложения в любое время с предварительным уведомлением или без такового.
    </p>
    <p>
      4.6. Администрация Сайта старается обеспечить надлежащее функционирование Сайта в круглосуточном режиме, однако она не несет никакой ответственности, если произойдут какие-либо нарушения в работе Сайта по любым причинам. Администрация Сайта не гарантирует, что Информация, размещенная на Сайте, будет доступна в любое время, или не будет удалена или утеряна. Администрация Сайта не несет ответственности за сбои и задержки в работе Сайта, а также за возможные последствия таких сбоев и задержек.
    </p>
    <p>
      4.7. Администрация Сайта не несет ответственности за возможную утечку Информации из базы данных Сайта по любым причинам, в том числе в результате несанкционированных действий третьих лиц. Администрация Сайта не несет ответственности за наличие на Сайте вирусов, а также за возможные последствия заражения компьютера Пользователя вирусами или попадание на компьютер Пользователя иных вредоносных программ. Администрация Сайта предоставляет Сайт Пользователю «как есть» без каких-либо дополнительных гарантий.
    </p>
    <p>
      4.8. Администрация Сайта не несет ответственность за любые убытки, включая упущенную выгоду, моральный и иной ущерб, причиненный Пользователю или третьим лицам в результате использования ими Сайта, или в связи с функционированием Сайта, а также во всех иных случаях, предусмотренных настоящим Соглашением.
    </p>
    <p>
      4.9. Ссылка на любой сайт, контактные данные, продукт, услугу, информацию коммерческого или некоммерческого характера, размещенная на Сайте Пользователем или на правах рекламы, не является одобрением, рекомендацией или, наоборот, критикой со стороны Администрации Сайта.
    </p>
    <p>
      4.10. Пользователь обязуется своими силами и за свой счет разрешать все споры и урегулировать все претензии и иски третьих лиц, следовать предписаниям и требованиям уполномоченных государственных органов власти, поступившим как в адрес Пользователя, так и в адрес Администрации Сайта, в связи с размещением Пользователем Информации на Сайте, а также возместить все убытки и расходы, понесенные Администрацией Сайта в связи с такими претензиями и исками.
    </p>
    <p>
      4.11. Пользователь и Администрация Сайта будут пытаться решить все возникшие между ними споры и разногласия путем переговоров. В случае невозможности разрешить споры и разногласия путем переговоров они подлежат рассмотрению в соответствующем суде по месту нахождения Администрации Сайта.
    </p>
  </div>
)

export default Content
