import React from 'react'
import { StyleSheet } from 'quantum'
import Close from './Close'

const styles = StyleSheet.create({
  self: {
    height: '80%',
    width: '80%',
    maxWidth: '700px',
    maxHeight: '600px',
    background: '#ffffff',
    overflowY: 'auto',
    padding: '40px',
    fontFamily: 'Turum2',
    fontSize: '24px',
    boxSizing: 'border-box',
    position: 'relative',
    '& div': {
      fontWeight: 'bold',
      fontSize: '36px',
    },
    '& ul': {
      paddingLeft: '0px',
      '& li': {
        marginLeft: '20px',
      },
    },
  },
})

const stopWheel = (event) => {
  event.stopPropagation()
}

const Content = ({ onClose }) => (
  <div className={styles()} onWheel={stopWheel}>
    <Close onClick={onClose} />
    <div>
      Правила участия в проекте
    </div>
    <p>
      Я даю согласие Банку на обработку всех моих персональных данных, указанных в заявке, любыми способами, в том числе третьими лицами, в том числе воспроизведение, электронное копирование,обезличивание, блокирование, уничтожение, а также вышеуказанную обработку иных моих персональных данных, полученных в результате их обработки, с целью:
    </p>
    <p>
      <ul>
        <li>
          выпуска, обслуживания кредитных карт;
        </li>
        <li>
          создания информационных систем персональных данных Банка;
        </li>
        <li>
          страхования моей жизни/ здоровья/ имущества и иного страхования, осуществляемого при содействии Банка или в пользу Банка и/или в связи с заключением договора, а также в любых других целях,прямо или косвенно связанных с выпуском и обслуживанием кредитных карт и предложением иных продуктов Банка, и направления мне информации о новых продуктах и услугах Банка и/или его контрагентов.
        </li>
      </ul>
      Я даю согласие Банку на передачу персональных данных микрофинансовым организациям-Партнерам Банка (далее - МФО) и обработку персональных данных МФО с целью информирования меня о возможности получения от МФО потребительских кредитов (займов).
    </p>
    <p>
      Я даю согласие контрагентам Банка на обработку всех моих персональных данных, имеющихся в распоряжении/доступе Банка и/или контрагентов Банка, в том числе с использованием сети Интернет,а также на обработку сведений об абонентах и оказываемым им услугам связи (в случае если контрагентом Банка является оператор связи) с целью проведения оценки вероятности моей платежеспособностив будущем для принятия решения о выпуске кредитной карты.
    </p>
    <p>
        Я даю согласие контрагентам Банка на обработку всех моих персональных данных, имеющихся в распоряжении/доступе Банка и/или контрагентов Банка, в том числе с использованием сети Интернет,а также на обработку сведений об абонентах и оказываемым им услугам связи (в случае если контрагентом Банка является оператор связи) с целью проведения оценки вероятности моей платежеспособностив будущем для принятия решения о выпуске кредитной карты.
    </p>
    <p>
      Я даю согласие на предоставление Банком всей имеющейся обо мне информацию в объеме, в порядке и на условиях, определенных Федеральным законом «О кредитных историях»№ 218-ФЗ от 30 декабря 2004 года, во все бюро кредитных историй, включенные в государственный реестр бюро кредитных историй, а также на получение кредитного отчетаиз вышеозначенных бюро для заключения Договора и в течение срока действия Договора.
    </p>
    <p>
      Я даю согласие на получение мной рассылки по сети подвижной радиотелефонной связи от Банка и его аффилированных лиц.
    </p>
  </div>
)

export default Content
